{
  "2021-06-30-Setting_up_Datacrunch.io_from_scratch.md": {
    "Setting up Datacrunch.io from scratch": "You are more than welcome to skip the following 2 sections directly to the setup. If you haven’t already know, datacrunch.io offers one of the cheapest option for a single dedicated V100"
  },
  "2021-07-02-Tips_and_Tricks_with_sending_jobs_to_Azure_ML_Compute_Clusters.md": {
    "Tips and Tricks with sending jobs to Azure ML Compute Clusters": "Recently, especially when trying out new things, one feels frustrated when things just don’t go smoothly. Especially with sending jobs to Azure ML Clusters, or perhaps other providers as well where you"
  },
  "2021-07-04-Sourcing_Images_Build_Model_and_Deployment.md": {
    "Sourcing Images, Build Model, and Deployment": "As an exercise for Chapter 2: Production of Fast.ai, we are to outsource our images and build our own image classifier. Outsourcing from the internet haven’t been the best experience. This time,"
  },
  "2021-07-26-eye-of-ml-the-object-detection-program.md": {
    "Eye of ML Summary": "Eye of ML is a simple object detection program. It connects to your main webcam for input, and output the image in real time. To run, just run render.py (if it works"
  },
  "2021-08-02-Opinions_on_model_decision.md": {
    "Opinions: Machine Learning, their outcomes, and decision making": "Machine Learning (ML) lacks decision making in the loop. We have computer vision programs, and their output are useful. But outputs are just outputs, they aren’t making any decisions. Example of decision"
  },
  "2021-08-06-playing_with_cnn_quantization.md": {
    "Playing with CNN Quantization": "Quantization of models have been a fad and research focused topic nowadays, particularly with INT8 as weights, it could speed up model inference and also create more lightweight models. Some APIs provide"
  },
  "2021-08-16-PyTorch_xla_tpu_utility.md": {
    "[PyTorch XLA TPU Utility](https://github.com/Wabinab/TPU_utility)": "Goal: To ease the usage of TPU without much changes in your original code, provided the original code is more functionally written. Tensor Processing Unit (TPU) is a very fast hardware in"
  },
  "2021-12-01-Dealing_with_QGIS.md": {
    "Dealing with QGIS": "This is not a actual blog post discussing on anything in particular. Rather, it’s more like a diary of what is encountered, what is solved, as time passes. And it’s more like"
  },
  "2021-12-26-Why_some_people_cant_program_and_how_to_teach_them.md": {
    "Why Some People Can't Program, and How to Teach Them?": "There is a draft research paper (well, read more like a blog post) that mentioned on the two extremes of people who can’t program and who can program. Today, one would like"
  },
  "2022-01-05-Diary_Ruby_On_Rails_Getting_Started.md": {
    "Diary: Ruby On Rails Getting Started": "One is working on learning Ruby on Rails currently, and there are some problems that are met. This post serves as a diary to conclude what errors are being made, and how"
  },
  "2022-01-12-Opinion_on_what_easy_means_for_programming.md": {
    "Opinion on what \"easy\" means for programming": "When one learns about Ruby on Rails, one found the idea “convention over configuration” great. Whether or not one understood (or misunderstood) that idea, it lays down a foundation over what we"
  },
  "2022-03-03-Rust_testing_feature_learned.md": {
    "Rust testing features learned": "This article hopes to speak about one’s learning today about Rust testing feature and smart contract, including the pain of using pre-release rather than stable version. When one is experimenting with Rust"
  },
  "2022-04-14-NEAR_Protocol_and_Rails.md": {
    "NEAR Protocol and Rails": "(Non-technical summary post on read.cash will be included later when completed). (This article will never be completed. As we learn, we add more stuffs. If it gets stuffed with too many lines,"
  },
  "2022-04-22-Azure_VM_with_VSCode_Resetup.md": {
    "Azure VM with VSCode Re-setup": "Sometimes, Azure VM can lost connectivity. Most probably the reason is frequently changing the “size” of the VM; as other VM that infrequently or never changes size didn’t have this problem. Hence,"
  },
  "2022-05-02-Optimizing_Contract.md": {
    "Optimizing Smart Contract Gas and Storage Consumption": "Recently we did a competition on SiNEAR_EA_* repo, and there are some idea on optimization. First, we have quite a lot of repeats in Contract interface, including tokens_by_owner and tokens_by_owner_ordered. We could"
  },
  "2022-05-03-Optimizing_Gas_NEAR_Protocol.md": {
    "Near Protocol Contract: Optimizing Gas and Debunk Mysteries": "Recently, there’s a function that uses too much gas, from one’s perspective; and we have Spring is NEAR Challenge 7 going on, so one decide to speak about gas. Let’s see some"
  },
  "2022-05-04-Roketo_v2_API_experimentation.md": {
    "Experimenting with Roketo v2 API: A Diary": "Referencing: Roketo v2 API First, check the “stream creation” part. Let’s explain an error: - Remember to make “double backslashes” into “single backslashes”. In near api js, we perhaps don’t need to"
  },
  "2022-05-30-Our_Doctrine.md": {
    "Our Doctrine": "Have you heard of the Rails Doctrine? We have our own doctrine: things that we follow and perhaps “wish” to change the world of. This doctrine will update as we change; and"
  },
  "2022-06-16-Minimal_Programming.md": {
    "Idea: Minimal Programming": "We know that software requires security update, because we never know how it’ll be hacked. There are thoughts on, however, minimal programming, where it doesn’t require security update to continue its usage."
  },
  "2022-07-27-Rails_7_Asynchronous_GET.md": {
    "How to \"GET\" (request) from database without reloading page in Rails 7": "While this page explains with stimulus and Rails in Rails 6, it only “almost” explain how to do it in Rails 7. Particularly, because respond_to got deprecated for some security reasons, what’s"
  },
  "2022-08-09-Postgresql_With_Rails.md": {
    "Postgresql With Rails": "As usual, this is just a diary of what problems being encountered during the process. Using Trigram in pg_search gem. As mentioned, we need a pg_trgm in pg_search gem. The problem is"
  },
  "2022-09-15-Rails_How_To_Create_Body_Without_JS.md": {
    "Rails How to Create body without JS.": "Rails use ERb, so if we change something that needs to change the basic structure, it needs to reload. So far, one haven’t found anyway to not reload if one are to"
  },
  "2022-12-28-Material_Lies_The_Base_of_Invention.md": {
    "Material Lies at the Base of Invention": "One used to tell stories about using what we have (limitations) to build amazing stuffs. That is, if you are only given these specific resources, what can you do with it, combining"
  },
  "2023-01-24-Thinking_Fast_and_Slow.md": {
    "Thinking, Fast and Slow: Some Conflicts?": "The title was the book by Daniel Kahneman. One just wants to talk a bit about oneself, probably something that goes unnoticed. Say, one agrees that most of the things are true,"
  },
  "2023-01-30-Angular_Material_With_Ngx_Bootstrap.md": {
    "Angular Material CSS clash with Ngx Bootstrap": "The idea is not to use Angular Material theme and use bootstrap theme, otherwise they clash with each other. But how we build some of the stuffs? For example, don’t use mat-form-field."
  },
  "2023-10-13-a_crypto_bug.md": {
    "Crypto Bug: Swapping Money": "One was interested in this NEAR Protocol (now called NEAR BOS, or NEAR Blockchain Operating System) coin a long time ago, and then one stopped for a bit after one found work"
  },
  "2024-02-12-A_Payment_System_On_Near_Protocol.md": {
    "A Payment System On Near Protocol": "While QR code scanning for wallet addresses are quite popular, it isn’t clear; how do we let the money receivers define the amount of money to receive, rather than the person doing"
  },
  "2999-12-31-my-principles.md": {
    "My Principles": "Life Principles 1. Never reject a non-damaging friendship from my side, only from the other person’s side. One should not let one’s self-talk oneself out of a relationship; rather, only when the"
  },
  "2024-02-27-Think_Again_Postmortem.md": {
    "Postmortem: Think Again By Adam Grant": "Ok, we updated to a new website today, so let’s write something. Previously, one had read a lot of books, but have never thought of making summarization until a few months back."
  },
  "2024-02-27-Hidden-Potential-Postmortem.md": {
    "Postmortem: Hidden Potential by Adam Grant": "Potential isn’t the matter of where you start, but of how far you travel. Humans don’t always live up to their capabilities. For example, one would waste time reading novels, because it’s"
  },
  "2024-02-28-Overcomplicated-Postmortem.md": {
    "Postmortem: Overcomplicated by Samuel Arbesman": "Imagine yourself building something. Then, imagine a hundred years later, they’re still in use. How can they provide maintenance? You’re long gone! When Voyager I, the only spacecraft (as of writing) that"
  },
  "2024-03-01-Grit.md": {
    "Postmortem: Grit by Angela Duckworth": "A few years ago, one started this book; till today, it’s not yet finished, two chapters to go. This book is one of the few, that one started out with negative emotions."
  },
  "2024-03-03-Exploratory.md": {
    "Relationships, Emotions, and the Future": "If relationship is the goal, and it is unattained, and it breeds remorse, do one still aim for relationships? The Stoics suggests we detach from our emotions, to be in control, not"
  }
}
